# FbxLightLumenaireDirt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightLumenaireDirt Property
ParameterTypeId Class See Also
---
"Luminaire Dirt Depreciation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightLumenaireDirt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightLumenaireDirt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightLumenaireDirt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace